{
	"version": "https://jsonfeed.org/version/1",
	"title": "Grant Isom",
	"icon": "https://micro.blog/grantisom/avatar.jpg",
	"home_page_url": "https://grantisom.com/",
	"feed_url": "https://grantisom.com/feed.json",
	"items": [
		
			{
				"id": "http://grantisom.micro.blog/2020/09/28/next-chapter.html",
				"title": "Next Chapter",
				"content_html": "<p>Starting back in July, I made the next move in my personal career. After meeting with one of my good friends, Alek, I decided to follow him to another Kansas City company, <a href=\"https://goilluminate.com\">Illuminate</a>.</p>\n\n<p><img src=\"https://grantisom.com/uploads/2021/b7a1a8fca6.png\" alt=\"\" /></p>\n\n<p>The one thing I had to really think about was stepping away from the app development world for a while. It has been a great space to start my career and is what got me into software from the beginning. But I would be doing myself a disservice staying so narrowly focused in one development ecosystem or frame. At Illuminate I have been working mainly on a “<a href=\"https://en.wikipedia.org/wiki/MLOps\">MLOps</a>” application for creating datasets for training models over. It allows our clinical experts to label radiology notes and documents efficiently, while also being a broad enough solution for any other similar data grouping.</p>\n\n<p>I have really enjoyed going to a smaller startup so far, our team moves fast, everyone gets along, and we have tons of really exciting opportunities in front of us as a company!</p>\n\n<p>I also think the change of technology stacks will lead to some interesting topics to talk about on here. Stay tuned!</p>\n",
				"content_text": "Starting back in July, I made the next move in my personal career. After meeting with one of my good friends, Alek, I decided to follow him to another Kansas City company, [Illuminate](https://goilluminate.com). \n\n![](https://grantisom.com/uploads/2021/b7a1a8fca6.png)\n\nThe one thing I had to really think about was stepping away from the app development world for a while. It has been a great space to start my career and is what got me into software from the beginning. But I would be doing myself a disservice staying so narrowly focused in one development ecosystem or frame. At Illuminate I have been working mainly on a “[MLOps](https://en.wikipedia.org/wiki/MLOps)” application for creating datasets for training models over. It allows our clinical experts to label radiology notes and documents efficiently, while also being a broad enough solution for any other similar data grouping.\n\nI have really enjoyed going to a smaller startup so far, our team moves fast, everyone gets along, and we have tons of really exciting opportunities in front of us as a company!\n\nI also think the change of technology stacks will lead to some interesting topics to talk about on here. Stay tuned!\n",
				"date_published": "2020-09-27T18:00:00-06:00",
				"url": "https://grantisom.com/2020/09/27/next-chapter.html",
				"tags": ["career"]
			},
			{
				"id": "http://grantisom.micro.blog/2020/05/29/using-safari-to.html",
				"title": "Using Safari to Inspect Web Views in iOS Simulators \u0026 Devices",
				"content_html": "<p>This week I wanted to talk about how to use Safari’s Developer Tools with Simulators or iOS devices in Safari or in your application’s web views. This is something that can be extremely helpful when working in web applications or in apps that have a mixture of web and native content as do ours at Cerner.</p>\n\n<p>Enabling Safari Debugging\nIf you are on a real device you will need to enable the Web Inspector first. Open Settings, then open Safari, scroll to the bottom and open Advanced. You should see an option for Web Inspector, enable this and you will see your phone as an option in the Develop menu item.</p>\n\n<p>If you are using a simulator, there is no setup after enabling the Develop mode in Safari.</p>\n\n<p><img src=\"https://grantisom.com/uploads/2021/5e77785356.png\" alt=\"Safari Settings\" /></p>\n\n<p>Enabling the Develop Menu Item\nIn Safari you will need to enable the Develop menu item before you can see any other available devices for inspection. Open Preferences <code>⌘ + ,</code> and open the Advanced section. At the bottom, check the box next to “Show Develop menu in menu bar”. Now you should see the Develop menu item and can chose web views or browser tabs to inspect on real devices or simulators!</p>\n\n<p><img src=\"https://grantisom.com/uploads/2021/26a428e244.png\" alt=\"Develop Menu\" /></p>\n\n<p>You are now all set! You can interact with the web inspector just like you can in Desktop Safari. The only caveat is that this will not work for apps that are from TestFlight or the App Store, so debug mode only. Hope this helps and happy coding!</p>\n",
				"content_text": "This week I wanted to talk about how to use Safari’s Developer Tools with Simulators or iOS devices in Safari or in your application’s web views. This is something that can be extremely helpful when working in web applications or in apps that have a mixture of web and native content as do ours at Cerner.\n\nEnabling Safari Debugging\nIf you are on a real device you will need to enable the Web Inspector first. Open Settings, then open Safari, scroll to the bottom and open Advanced. You should see an option for Web Inspector, enable this and you will see your phone as an option in the Develop menu item.\n\nIf you are using a simulator, there is no setup after enabling the Develop mode in Safari.\n\n![Safari Settings](https://grantisom.com/uploads/2021/5e77785356.png)\n\nEnabling the Develop Menu Item\nIn Safari you will need to enable the Develop menu item before you can see any other available devices for inspection. Open Preferences `⌘ + ,` and open the Advanced section. At the bottom, check the box next to “Show Develop menu in menu bar”. Now you should see the Develop menu item and can chose web views or browser tabs to inspect on real devices or simulators!\n\n![Develop Menu](https://grantisom.com/uploads/2021/26a428e244.png)\n\nYou are now all set! You can interact with the web inspector just like you can in Desktop Safari. The only caveat is that this will not work for apps that are from TestFlight or the App Store, so debug mode only. Hope this helps and happy coding!\n",
				"date_published": "2020-05-28T18:00:00-06:00",
				"url": "https://grantisom.com/2020/05/28/using-safari-to.html",
				"tags": ["development iOS"]
			},
			{
				"id": "http://grantisom.micro.blog/2020/05/23/my-top-apps.html",
				"title": "My Top 17 Apps for Mobile Developers in 2020",
				"content_html": "<p>As a mobile developer, having the right tools and setup on your machine can become a massive time saver and boost your productivity especially over time. While a lot of your development environment comes down to personal preference, these are the apps and plugins that are my &ldquo;must haves&rdquo; on any machine. I am thinking after this I want to do a tutorial on my dotfiles and setup scripts that install a lot of these from the Mac App Store and elsewhere. Also these are in no particular order as some aren’t comparable to others when it comes down to usefulness or necessity.</p>\n\n<p>Xcode\nOkay, so this is obvious, you cannot get too far building mobile apps without this app. Even if you use a hybrid framework, you will still need Xcode to create and publish any iOS, iPadOS, tvOS, or MacOS app.\n&gt; <a href=\"https://apps.apple.com/us/app/xcode/id497799835?mt=12\">Download Xcode on the Mac App Store</a></p>\n\n<p>Screen Sharing\nThis is an app that comes with your Mac that I use all the time at work. If we ever need to hop on a build machine this is honestly one of the easiest ways to do it. I have never had any issues or reasons to go download a better client, it does what its supposed to and saves your recent connections.</p>\n\n<p>FileMerge\nThis comes with the Xcode Developer Tools, I would not say this is my favorite file merge tool, even using Atom is way better but the GUI is nice when you have two files in Finder or on your desktop you want to compare quickly. If I am trying to find the differences between two text files or something simple, I use this.</p>\n\n<p>Android Studio\nAlong with Xcode, this is basically a requirement. You can use other IDE’s a little easier than Xcode, but I still think the official JetBrains version from Google is the easiest to use. There is a ton of configuration that goes along with Android Studio, but in my opinion is the easiest to use IDE for the job.\n&gt; <a href=\"https://developer.android.com/studio\">Download Android Studio</a></p>\n\n<p>Atom\nAtom has been my go-to editor for everything since college. While it seems <a href=\"https://code.visualstudio.com\">VSCode</a> has taken the new throne these days, I still fall back on Atom. The maturity of the plugins and the ability to install things quickly have always been huge selling points to me. Not a huge fan of chromium apps, but I still love using Atom. There are great plugins for things like previewing markdown either in the editor or in Marked 2, the git integration is not bad, and I love how quickly I can install support for a language or a plugin in the case I don’t already have something. Downsides are a lot of the plugins lose support over time and being a Chromium app, things tend to slowdown if you have too much going on.\n&gt; <a href=\"https://atom.io\">Download Atom</a></p>\n\n<p>Bear Notes\nI have tried so many notes apps for things like blogging to taking notes in meetings and finally settled on Bear. Previously I was using Apple Notes and Agenda, but the markdown support in Bear is awesome. I do miss the tables in Apple notes, but I love the hashtag system for creating groups and folders. It is super easy to link to other notes and you do things like lock notes or groups just like Apple Notes. If you subscribe to Pro, you get a bunch of great themes, export options, and syncing. It also works great with Marked 2 for previewing how things will look. Also sounds like tables and a couple other missing features are coming to Bear. Agenda was honestly really great, but felt it lacked too many basic features and I didn’t really use all the time based stuff it is built around.\n&gt; <a href=\"https://apps.apple.com/us/app/bear/id1091189122?mt=12\">Download Bear Notes on the Mac App Store</a></p>\n\n<p>Marked 2\nI started using Marked 2 when we started using Github for more and more things at work. It is a previewer for markdown files that allows you to style your text, check spelling, and a whole lot more.  It is nice when writing up a tech design to be able to preview it with Marked and see what it will look like once you push it. You can also create custom styles which I will be doing a post on later too. This is useful for previewing things like blog posts in the style or layout of your website. One cool thing you can do too is export as HTML, which could be helpful for blogging or create web articles.\n&gt; <a href=\"https://apps.apple.com/us/app/marked-2-markdown-preview/id890031187?mt=12\">Download Marked 2 on the Mac App Store</a></p>\n\n<p>SnippetsLab\nSnippetsLab is great library for saving useful snippets across IDE’s and editors. It also has support for syncing with Github Gist’s or iCloud so you can backup all these and sync across devices. I have it on my work and personal laptops which is great for using helpful bits of code in personal and work projects. It has tons of organization options and support for markdown as well if you wanted to use it for that.\n&gt; <a href=\"https://apps.apple.com/us/app/snippetslab/id1006087419?mt=12\">Download ‎SnippetsLab on the Mac App Store</a></p>\n\n<p>Tower\nSo I hesitated putting this on here, but if you absolutely have to use a GUI, then I guess this is the best of the GUI’s for Git. I highly recommend learning and using git in the command line, but if you really don’t want to, Tower is definitely the best one I have used over Github’s Mac app and other editors built-in Git support. You limit what and how you do things with a WYSIWYG tool, but Tower is the better of the evils.\n&gt; <a href=\"https://www.git-tower.com/mac\">Download Tower</a></p>\n\n<p>SF Symbols\nSF Symbols is a sweet app from Apple that lets you browse the new system icons available in iOS 13. While using the <code>init?(systemName name:  String)</code>  is only <a href=\"https://developer.apple.com/documentation/uikit/uiimage/3294233-init\">available in iOS 13</a>, you can use this app to export these icons as SVG’s for use in your apps that support iOS 12 and below.\n&gt; <a href=\"https://developer.apple.com/design/human-interface-guidelines/sf-symbols/overview/\">Download SF Symbols</a></p>\n\n<p>Swift Playgrounds\nWhile this one is not really going to boost your productivity or be a new tool in your development toolbox, it is a great way to play around with Swift or learn. It also has support for some things like Lego Mindstorms, which is pretty cool. It supports Xcode Playgrounds also, so if you are doing anything in Xcode Playgrounds, it can be a more visually appealing way to interact or code in them.\n&gt; <a href=\"https://apps.apple.com/us/app/swift-playgrounds/id1496833156?mt=12\">Download Swift Playgrounds on the Mac App Store</a></p>\n\n<p>iTerm\niTerm is a terminal replacement that brings a lot to the table out of the box. You have search, easy window splitting, a really cool new status bar, autocomplete, and a whole lot more. And that is before any customization of your shell. I don’t think it makes too big of a difference using iTerm versus Terminal.app considering most of the magic comes from setting up your shell to your needs.\n&gt; <a href=\"https://www.iterm2.com/index.html\">Download iTerm2</a></p>\n\n<p>Sketch\nSketch is a prototyping tool that lets you create mockups and designs for software products. I have been using it for quite some time and even though I don’t do too much graphic design or UX stuff, I do love using it for my personal projects or wireframes. Compared to things like Omnigraffle or other similar tools, it is my favorite by far.\n&gt; <a href=\"https://www.sketch.com\">Download Sketch</a></p>\n\n<p>Pocket\nPocket is my favorite app for saving and sharing links. I have it on my iPhone, iPad, and both Macs and it does a great job of syncing saved links between them all. The desktop client has a quick command for saving links that are in your clipboard if you don’t use the browser or share extensions as well.\n&gt; <a href=\"https://apps.apple.com/us/app/pocket/id568494494?mt=12\">‎Download Pocket on the Mac App Store</a></p>\n\n<p>RESTed\nRESTed is a lightweight REST API client, it is essentially a boiled down version of Postman. I enjoy using this a lot more than Postman for things like personal projects and the ability to save requests as files is nice for simple things. I use it mainly on personal projects and stick to Postman for things like work or more complex calls.\n&gt; <a href=\"https://apps.apple.com/us/app/rested-simple-http-requests/id421879749?mt=12\">Download ‎RESTed on the Mac App Store</a></p>\n\n<p>InjectionIII\nInjection is a really cool app that lets you add some “hot reloading” to your Xcode projects. It supports iOS, tvOS, or MacOS. It is not perfect but can be really helpful when making lots of small UI tweaks or changes. I usually add it and occasionally enable it when needed. It is easy to setup with just a single line.\n<code>Bundle(path: “/Applications/InjectionIII.app/Contents/Resources/iOSInjection.bundle”)?.load()</code>\n&gt; <a href=\"https://apps.apple.com/us/app/injectioniii/id1380446739?mt=12\">Download ‎InjectionIII on the Mac App Store</a></p>\n\n<p>DevCleaner\nDevCleaner is a great app for clearing out old device support files, derived  data, or or old archives. It has an easy interface to see and sort through what you want to delete or keep. Hovering over the top level sections will tell you what each is if you are not familiar with the Xcode build system. It has a cool counter of how many GB’s you have “saved” along with a way to leave a tip to the developer.\n&gt; <a href=\"https://apps.apple.com/us/app/devcleaner-for-xcode/id1388020431\">Download ‎DevCleaner for Xcode on the Mac App Store</a></p>\n\n<p>JSONPeep\nFor my work’s slew of apps, they tend to have a good chunk of web content, which means using Safari’s developer tools to inspect the web view’s etc. So this plugin is a huge help if, like me, you end up using Safari a majority of the time. It allows you to view JSON in a readable format adding a little button to whenever you view a JSON file in your browser.\n&gt; <a href=\"https://apps.apple.com/us/app/json-peep-for-safari/id1458969831?mt=12\">Download ‎JSON Peep for Safari on the Mac App Store</a></p>\n\n<p>Sip\nSip is the best color picker for Mac that I have found. You always have access to it from the Menu Bar and it allows you to save, copy, and organize your recently picked colors. It also lets you copy them in a ton of formats like NSColor, UIColor, or just hexadecimal.</p>\n\n<blockquote>\n<p><a href=\"https://sipapp.io\">Download Sip</a></p>\n</blockquote>\n\n<p>So while this list definitely is always changing, these are my current go to applications for mobile development in one way or another. I hope this helps and maybe some of these are new to you! Anyways, enjoy and please let me know what some of your favorites are not on this list.</p>\n",
				"content_text": "As a mobile developer, having the right tools and setup on your machine can become a massive time saver and boost your productivity especially over time. While a lot of your development environment comes down to personal preference, these are the apps and plugins that are my \"must haves\" on any machine. I am thinking after this I want to do a tutorial on my dotfiles and setup scripts that install a lot of these from the Mac App Store and elsewhere. Also these are in no particular order as some aren’t comparable to others when it comes down to usefulness or necessity.\n\nXcode\nOkay, so this is obvious, you cannot get too far building mobile apps without this app. Even if you use a hybrid framework, you will still need Xcode to create and publish any iOS, iPadOS, tvOS, or MacOS app.\n> [Download Xcode on the Mac App Store](https://apps.apple.com/us/app/xcode/id497799835?mt=12)\n\nScreen Sharing\nThis is an app that comes with your Mac that I use all the time at work. If we ever need to hop on a build machine this is honestly one of the easiest ways to do it. I have never had any issues or reasons to go download a better client, it does what its supposed to and saves your recent connections.\n\nFileMerge\nThis comes with the Xcode Developer Tools, I would not say this is my favorite file merge tool, even using Atom is way better but the GUI is nice when you have two files in Finder or on your desktop you want to compare quickly. If I am trying to find the differences between two text files or something simple, I use this.\n\nAndroid Studio\nAlong with Xcode, this is basically a requirement. You can use other IDE’s a little easier than Xcode, but I still think the official JetBrains version from Google is the easiest to use. There is a ton of configuration that goes along with Android Studio, but in my opinion is the easiest to use IDE for the job.\n> [Download Android Studio](https://developer.android.com/studio)\n\nAtom\nAtom has been my go-to editor for everything since college. While it seems [VSCode](https://code.visualstudio.com) has taken the new throne these days, I still fall back on Atom. The maturity of the plugins and the ability to install things quickly have always been huge selling points to me. Not a huge fan of chromium apps, but I still love using Atom. There are great plugins for things like previewing markdown either in the editor or in Marked 2, the git integration is not bad, and I love how quickly I can install support for a language or a plugin in the case I don’t already have something. Downsides are a lot of the plugins lose support over time and being a Chromium app, things tend to slowdown if you have too much going on.\n> [Download Atom](https://atom.io)\n\nBear Notes\nI have tried so many notes apps for things like blogging to taking notes in meetings and finally settled on Bear. Previously I was using Apple Notes and Agenda, but the markdown support in Bear is awesome. I do miss the tables in Apple notes, but I love the hashtag system for creating groups and folders. It is super easy to link to other notes and you do things like lock notes or groups just like Apple Notes. If you subscribe to Pro, you get a bunch of great themes, export options, and syncing. It also works great with Marked 2 for previewing how things will look. Also sounds like tables and a couple other missing features are coming to Bear. Agenda was honestly really great, but felt it lacked too many basic features and I didn’t really use all the time based stuff it is built around.\n> [Download Bear Notes on the Mac App Store](https://apps.apple.com/us/app/bear/id1091189122?mt=12)\n\nMarked 2\nI started using Marked 2 when we started using Github for more and more things at work. It is a previewer for markdown files that allows you to style your text, check spelling, and a whole lot more.  It is nice when writing up a tech design to be able to preview it with Marked and see what it will look like once you push it. You can also create custom styles which I will be doing a post on later too. This is useful for previewing things like blog posts in the style or layout of your website. One cool thing you can do too is export as HTML, which could be helpful for blogging or create web articles.\n> [Download Marked 2 on the Mac App Store](https://apps.apple.com/us/app/marked-2-markdown-preview/id890031187?mt=12)\n\nSnippetsLab\nSnippetsLab is great library for saving useful snippets across IDE’s and editors. It also has support for syncing with Github Gist’s or iCloud so you can backup all these and sync across devices. I have it on my work and personal laptops which is great for using helpful bits of code in personal and work projects. It has tons of organization options and support for markdown as well if you wanted to use it for that.\n> [Download ‎SnippetsLab on the Mac App Store](https://apps.apple.com/us/app/snippetslab/id1006087419?mt=12)\n\nTower\nSo I hesitated putting this on here, but if you absolutely have to use a GUI, then I guess this is the best of the GUI’s for Git. I highly recommend learning and using git in the command line, but if you really don’t want to, Tower is definitely the best one I have used over Github’s Mac app and other editors built-in Git support. You limit what and how you do things with a WYSIWYG tool, but Tower is the better of the evils.\n> [Download Tower](https://www.git-tower.com/mac)\n\nSF Symbols\nSF Symbols is a sweet app from Apple that lets you browse the new system icons available in iOS 13. While using the `init?(systemName name:  String)`  is only [available in iOS 13](https://developer.apple.com/documentation/uikit/uiimage/3294233-init), you can use this app to export these icons as SVG’s for use in your apps that support iOS 12 and below.\n> [Download SF Symbols](https://developer.apple.com/design/human-interface-guidelines/sf-symbols/overview/)\n\nSwift Playgrounds\nWhile this one is not really going to boost your productivity or be a new tool in your development toolbox, it is a great way to play around with Swift or learn. It also has support for some things like Lego Mindstorms, which is pretty cool. It supports Xcode Playgrounds also, so if you are doing anything in Xcode Playgrounds, it can be a more visually appealing way to interact or code in them.\n> [Download Swift Playgrounds on the Mac App Store](https://apps.apple.com/us/app/swift-playgrounds/id1496833156?mt=12)\n\niTerm\niTerm is a terminal replacement that brings a lot to the table out of the box. You have search, easy window splitting, a really cool new status bar, autocomplete, and a whole lot more. And that is before any customization of your shell. I don’t think it makes too big of a difference using iTerm versus Terminal.app considering most of the magic comes from setting up your shell to your needs.\n> [Download iTerm2](https://www.iterm2.com/index.html)\n\nSketch\nSketch is a prototyping tool that lets you create mockups and designs for software products. I have been using it for quite some time and even though I don’t do too much graphic design or UX stuff, I do love using it for my personal projects or wireframes. Compared to things like Omnigraffle or other similar tools, it is my favorite by far.\n> [Download Sketch](https://www.sketch.com)\n\nPocket\nPocket is my favorite app for saving and sharing links. I have it on my iPhone, iPad, and both Macs and it does a great job of syncing saved links between them all. The desktop client has a quick command for saving links that are in your clipboard if you don’t use the browser or share extensions as well.\n> [‎Download Pocket on the Mac App Store](https://apps.apple.com/us/app/pocket/id568494494?mt=12)\n\nRESTed\nRESTed is a lightweight REST API client, it is essentially a boiled down version of Postman. I enjoy using this a lot more than Postman for things like personal projects and the ability to save requests as files is nice for simple things. I use it mainly on personal projects and stick to Postman for things like work or more complex calls.\n> [Download ‎RESTed on the Mac App Store](https://apps.apple.com/us/app/rested-simple-http-requests/id421879749?mt=12)\n\nInjectionIII\nInjection is a really cool app that lets you add some “hot reloading” to your Xcode projects. It supports iOS, tvOS, or MacOS. It is not perfect but can be really helpful when making lots of small UI tweaks or changes. I usually add it and occasionally enable it when needed. It is easy to setup with just a single line.\n`Bundle(path: “/Applications/InjectionIII.app/Contents/Resources/iOSInjection.bundle”)?.load()`\n> [Download ‎InjectionIII on the Mac App Store](https://apps.apple.com/us/app/injectioniii/id1380446739?mt=12)\n\nDevCleaner\nDevCleaner is a great app for clearing out old device support files, derived  data, or or old archives. It has an easy interface to see and sort through what you want to delete or keep. Hovering over the top level sections will tell you what each is if you are not familiar with the Xcode build system. It has a cool counter of how many GB’s you have “saved” along with a way to leave a tip to the developer.\n> [Download ‎DevCleaner for Xcode on the Mac App Store](https://apps.apple.com/us/app/devcleaner-for-xcode/id1388020431)\n\nJSONPeep\nFor my work’s slew of apps, they tend to have a good chunk of web content, which means using Safari’s developer tools to inspect the web view’s etc. So this plugin is a huge help if, like me, you end up using Safari a majority of the time. It allows you to view JSON in a readable format adding a little button to whenever you view a JSON file in your browser.\n> [Download ‎JSON Peep for Safari on the Mac App Store](https://apps.apple.com/us/app/json-peep-for-safari/id1458969831?mt=12)\n\nSip\nSip is the best color picker for Mac that I have found. You always have access to it from the Menu Bar and it allows you to save, copy, and organize your recently picked colors. It also lets you copy them in a ton of formats like NSColor, UIColor, or just hexadecimal.\n\n> [Download Sip](https://sipapp.io)\n\nSo while this list definitely is always changing, these are my current go to applications for mobile development in one way or another. I hope this helps and maybe some of these are new to you! Anyways, enjoy and please let me know what some of your favorites are not on this list.\n",
				"date_published": "2020-05-22T18:00:00-06:00",
				"url": "https://grantisom.com/2020/05/22/my-top-apps.html",
				"tags": ["development iOS Android"]
			},
			{
				"id": "http://grantisom.micro.blog/2020/02/10/playlists.html",
				"title": "2019 Playlists",
				"content_html": "<p>Here is a list of what I listened to throughout the past year.</p>\n\n<iframe src=\"https://open.spotify.com/embed/playlist/0k2Z99vVEEqEkbGjX68QV3\" width=\"300\" height=\"380\" frameborder=\"0\" allowtransparency=\"true\" allow=\"encrypted-media\"></iframe>\n\n<iframe src=\"https://open.spotify.com/embed/playlist/3yi2q7L4l7mSXqNamoXds1\" width=\"300\" height=\"380\" frameborder=\"0\" allowtransparency=\"true\" allow=\"encrypted-media\"></iframe>\n\n<iframe src=\"https://open.spotify.com/embed/playlist/2RWLMYcKhJjkvnIstRvtKU\" width=\"300\" height=\"380\" frameborder=\"0\" allowtransparency=\"true\" allow=\"encrypted-media\"></iframe>\n\n<iframe src=\"https://open.spotify.com/embed/playlist/6SWxGu5rjYSBfVFHsBu6DH\" width=\"300\" height=\"380\" frameborder=\"0\" allowtransparency=\"true\" allow=\"encrypted-media\"></iframe>\n",
				"content_text": "Here is a list of what I listened to throughout the past year.\n\n<iframe src=\"https://open.spotify.com/embed/playlist/0k2Z99vVEEqEkbGjX68QV3\" width=\"300\" height=\"380\" frameborder=\"0\" allowtransparency=\"true\" allow=\"encrypted-media\"></iframe>\n\n<iframe src=\"https://open.spotify.com/embed/playlist/3yi2q7L4l7mSXqNamoXds1\" width=\"300\" height=\"380\" frameborder=\"0\" allowtransparency=\"true\" allow=\"encrypted-media\"></iframe>\n\n<iframe src=\"https://open.spotify.com/embed/playlist/2RWLMYcKhJjkvnIstRvtKU\" width=\"300\" height=\"380\" frameborder=\"0\" allowtransparency=\"true\" allow=\"encrypted-media\"></iframe>\n\n<iframe src=\"https://open.spotify.com/embed/playlist/6SWxGu5rjYSBfVFHsBu6DH\" width=\"300\" height=\"380\" frameborder=\"0\" allowtransparency=\"true\" allow=\"encrypted-media\"></iframe>\n",
				"date_published": "2020-02-09T18:00:00-06:00",
				"url": "https://grantisom.com/2020/02/09/playlists.html",
				"tags": ["music spotify"]
			},
			{
				"id": "http://grantisom.micro.blog/2019/06/09/wwdc-in-review.html",
				"title": "WWDC 2019, In Review",
				"content_html": "<p>I still cannot get over this week, from the awesome announcements, great sessions, labs, and all the amazing friends I made. I feel totally reenergized to bring back all this knowledge to my team and continue working on my own projects again. I am going to really try and make this a yearly trip. I feel so blessed to have gotten to spend this past week learning, exploring, and partying all over San Jose with a few thousand of fellow developers. I am going to do a follow up post that will be more of the technical aspects of the conference I like and maybe a deep dive into a couple things I am really interested in (Combine, SwiftUI, Independent Watch Apps, idk new to this). I was so inspired by all the indie developers just crushing it out there solo. But regardless this is not a week I will forget for a long time. Also Weezer was dope.</p>\n",
				"content_text": "\nI still cannot get over this week, from the awesome announcements, great sessions, labs, and all the amazing friends I made. I feel totally reenergized to bring back all this knowledge to my team and continue working on my own projects again. I am going to really try and make this a yearly trip. I feel so blessed to have gotten to spend this past week learning, exploring, and partying all over San Jose with a few thousand of fellow developers. I am going to do a follow up post that will be more of the technical aspects of the conference I like and maybe a deep dive into a couple things I am really interested in (Combine, SwiftUI, Independent Watch Apps, idk new to this). I was so inspired by all the indie developers just crushing it out there solo. But regardless this is not a week I will forget for a long time. Also Weezer was dope.\n",
				"date_published": "2019-06-08T18:00:00-06:00",
				"url": "https://grantisom.com/2019/06/08/wwdc-in-review.html",
				"tags": ["wwdc ios conferences"]
			},
			{
				"id": "http://grantisom.micro.blog/2019/06/08/wwdc-day.html",
				"title": "WWDC Day 4",
				"content_html": "\n\n<h2 id=\"tired-morning-more-sessions-and-meetups\">Tired Morning, More Sessions and Meetups</h2>\n\n<p>Another day full of sessions, great lunch discussions with Apple Education, and Accessibility labs reviewing our HealtheLife App. I am just overwhelmed with how great the Apple engineers have been and how great the sessions were. At the end of the conference I am going to do a write up of my favorite things and big points and takeaways from the sessions. Overall I hope I get to come to this every year. What an incredible event and what incredible people who put this on. I am already feeling so inspired and revved up to go develop new things, take this knowledge back to my teams, and just make new stuff!</p>\n\n<h2 id=\"exploring-san-jose\">Exploring San Jose</h2>\n\n<p>Took some time to walk around San Jose and check out the downtown before getting ready for the bash. Met the 1Password team, really nice guys from all over the US and Canada.</p>\n\n<h2 id=\"the-bash\">The Bash</h2>\n\n<p>Last night, was an incredible outdoor venue with a sweet performance by Weezer. Met some more great developers and hung out with my fellow Cerner dev, Young. Got some pictures with Craig from Apple and then that was about it. Now time to get back to the real world!</p>\n",
				"content_text": "## Tired Morning, More Sessions and Meetups\n\nAnother day full of sessions, great lunch discussions with Apple Education, and Accessibility labs reviewing our HealtheLife App. I am just overwhelmed with how great the Apple engineers have been and how great the sessions were. At the end of the conference I am going to do a write up of my favorite things and big points and takeaways from the sessions. Overall I hope I get to come to this every year. What an incredible event and what incredible people who put this on. I am already feeling so inspired and revved up to go develop new things, take this knowledge back to my teams, and just make new stuff!\n\n## Exploring San Jose\n\nTook some time to walk around San Jose and check out the downtown before getting ready for the bash. Met the 1Password team, really nice guys from all over the US and Canada.\n\n## The Bash\n\nLast night, was an incredible outdoor venue with a sweet performance by Weezer. Met some more great developers and hung out with my fellow Cerner dev, Young. Got some pictures with Craig from Apple and then that was about it. Now time to get back to the real world!\n",
				"date_published": "2019-06-07T18:00:00-06:00",
				"url": "https://grantisom.com/2019/06/07/wwdc-day.html",
				"tags": ["wwdc ios conferences"]
			},
			{
				"id": "http://grantisom.micro.blog/2019/06/07/wwdc-day.html",
				"title": "WWDC Day 3",
				"content_html": "\n\n<h2 id=\"another-day-of-sessions-labs-and-buying-swag\">Another Day of Sessions, Labs, and Buying Swag</h2>\n\n<p>The majority of the second day was spent in more labs, sessions, and not being able to control my impulses buying swag. I had some awesome conversations in the HealthKit Labs with one of the doctors that worked on the Health Records Feature in Apple Health with Cerner which was very cool and then went to some cool lunch and evening panels with the Health teams talking about their new features, how they deal with regulations, and the future of features like the ECG on the watch. It was also super interesting hearing developers voice concern and challenge some of the their blanket statement responses on a couple questions. After that, I grabbed some WWDC swag and headed out for the day over to a WeWork happy hour. That was pretty short, so went home got ready for the night and headed over to Live Near WWDC, a concert put on by James Dempsey and the Breakpoints. It was an awesome event, met so many great people, from some guys from the Target iOS Team, freelances from Australia, Dave Verwer, and then some super cool Apple engineers. All in all, this was by far the most packed and fun day yet.</p>\n",
				"content_text": "\n## Another Day of Sessions, Labs, and Buying Swag\n\nThe majority of the second day was spent in more labs, sessions, and not being able to control my impulses buying swag. I had some awesome conversations in the HealthKit Labs with one of the doctors that worked on the Health Records Feature in Apple Health with Cerner which was very cool and then went to some cool lunch and evening panels with the Health teams talking about their new features, how they deal with regulations, and the future of features like the ECG on the watch. It was also super interesting hearing developers voice concern and challenge some of the their blanket statement responses on a couple questions. After that, I grabbed some WWDC swag and headed out for the day over to a WeWork happy hour. That was pretty short, so went home got ready for the night and headed over to Live Near WWDC, a concert put on by James Dempsey and the Breakpoints. It was an awesome event, met so many great people, from some guys from the Target iOS Team, freelances from Australia, Dave Verwer, and then some super cool Apple engineers. All in all, this was by far the most packed and fun day yet.\n",
				"date_published": "2019-06-06T18:00:00-06:00",
				"url": "https://grantisom.com/2019/06/06/wwdc-day.html",
				"tags": ["wwdc ios conferences"]
			},
			{
				"id": "http://grantisom.micro.blog/2019/06/06/wwdc-day.html",
				"title": "WWDC Day 2",
				"content_html": "\n\n<h2 id=\"starting-the-day-with-aaptiv\">Starting the Day with Aaptiv</h2>\n\n<p>The second day started with a morning HIIT workout with a audio workout app, Aaptiv. The workout was fun in a super cool venue and was another great way to meet people and get the day off to a roar. Afterwards there was a sweet coffee bar and breakfast snacks and drinks. I drank some detox drink, no clue what it was but it was pretty good.</p>\n\n<h2 id=\"the-beginning-of-labs-and-sessions\">The beginning of Labs and Sessions</h2>\n\n<p>So for the rest of the day I spent most my time attending session and going to labs. Learning what’s new in Xcode and how Core Data can work with CloudKit out of the box to keep data stores in sync was fascinating and added to just how many updates are coming with these next releases. The sessions on SF Symbols and creating independent watch apps was super cool. The idea of a watch being able to be used with a phone at all and got me very excited for the upcoming hardware releases in September. Throughout the day I attended the WatchOS and SiriKit Labs, where I had 1 on 1 time with Apple engineers diving into current problems I have with my apps and how we could be leveraging some of these new or recently released features. With how much Apple is pushing Siri and Shortcuts it is going to be exciting to see what developers and hopefully what we do at Cerner and myHomework with these changes.</p>\n\n<h2 id=\"music-on-the-plaza\">Music on the Plaza</h2>\n\n<p>After everything came to an end, Apple had live music and drinks on the plaza in the front of the convention center where they gave out cool pins and had a good beer selection. Following that it was off to some happy hours.</p>\n\n<h2 id=\"weird-joint-activbody-vapor-happy-hour\">Weird Joint Activbody/Vapor Happy Hour</h2>\n\n<p>Before going to dinner in Palo Alto that night, I headed over to The Blue Chip for a happy hour held by Activbody that was also a Vapor Meetup sort of kind of. The Activbody team was showing off some hardware which was pretty cool and seems useful for physical therapy, but to be honest, it was a pretty weird device. The vapor guys were super nice and was fun to put a face to the super cool project that is Vapor.</p>\n\n<h2 id=\"palo-alto\">Palo Alto</h2>\n\n<p>After all that, I Ubered to Palo Alto to meet up with one of my great friends, Cole Jurden. He’s killing it in San Francisco and it was great catching up and exploring the city where so much history has taken place. Also there were these Swedish guys killing it at a Karaoke bar. Then back to San Jose for the next day!</p>\n",
				"content_text": "\n## Starting the Day with Aaptiv\n\nThe second day started with a morning HIIT workout with a audio workout app, Aaptiv. The workout was fun in a super cool venue and was another great way to meet people and get the day off to a roar. Afterwards there was a sweet coffee bar and breakfast snacks and drinks. I drank some detox drink, no clue what it was but it was pretty good.\n\n## The beginning of Labs and Sessions\nSo for the rest of the day I spent most my time attending session and going to labs. Learning what’s new in Xcode and how Core Data can work with CloudKit out of the box to keep data stores in sync was fascinating and added to just how many updates are coming with these next releases. The sessions on SF Symbols and creating independent watch apps was super cool. The idea of a watch being able to be used with a phone at all and got me very excited for the upcoming hardware releases in September. Throughout the day I attended the WatchOS and SiriKit Labs, where I had 1 on 1 time with Apple engineers diving into current problems I have with my apps and how we could be leveraging some of these new or recently released features. With how much Apple is pushing Siri and Shortcuts it is going to be exciting to see what developers and hopefully what we do at Cerner and myHomework with these changes.\n\n## Music on the Plaza\nAfter everything came to an end, Apple had live music and drinks on the plaza in the front of the convention center where they gave out cool pins and had a good beer selection. Following that it was off to some happy hours.\n## Weird Joint Activbody/Vapor Happy Hour\nBefore going to dinner in Palo Alto that night, I headed over to The Blue Chip for a happy hour held by Activbody that was also a Vapor Meetup sort of kind of. The Activbody team was showing off some hardware which was pretty cool and seems useful for physical therapy, but to be honest, it was a pretty weird device. The vapor guys were super nice and was fun to put a face to the super cool project that is Vapor.\n\n## Palo Alto\nAfter all that, I Ubered to Palo Alto to meet up with one of my great friends, Cole Jurden. He’s killing it in San Francisco and it was great catching up and exploring the city where so much history has taken place. Also there were these Swedish guys killing it at a Karaoke bar. Then back to San Jose for the next day!\n",
				"date_published": "2019-06-05T18:00:00-06:00",
				"url": "https://grantisom.com/2019/06/05/wwdc-day.html",
				"tags": ["wwdc ios conferences"]
			},
			{
				"id": "http://grantisom.micro.blog/2019/06/04/wwdc-day.html",
				"title": "WWDC Day 1",
				"content_html": "\n\n<h1 id=\"arriving-in-san-jose\">Arriving in San Jose</h1>\n\n<p>I got into San Jose late Sunday night and pretty much when straight to bed. The Fairmont has been amazing so far and is close to the conference which is nice.</p>\n\n<h1 id=\"registration-and-pre-keynote\">Registration and Pre Keynote</h1>\n\n<p>Arriving at the convention center was something to behold, being my first major tech conference I was seriously overwhelmed by the whole experience. The outside wall for “Dub Dub” (the official nickname) was incredibly cool and if you watched it, it would light up in spectacular fashion. Getting registered was fun waiting with all the other developers. It is such a global crowd here that making friends in line was always interesting hearing where they were from and what they were working on. The Apple Store employees helping everyone were so high energy and hilarious throughout the day, l literally do not understand how they stayed so excited for the entire day. Once I got registered and received my badge, we left the building and re-entered a line for the keynote. I had gotten there a little bit before 6:30 so I ended up getting a pretty good seat. The wait to enter the Hall for the Keynote took about a total of 3 hours, but they feed us breakfast and was fun meeting more developers.</p>\n\n<h1 id=\"keynote-time\">Keynote Time</h1>\n\n<p>The keynote itself was amazing, I think I can say for a lot of us there they revealed a lot more than anyone expected. From SwiftUI to the literally most insane desktop Mac ever, the Mac Pro, it was an amazing keynote. Seeing it in person for the first time was really dope. I have watched it every year since high school and it was amazing getting to actually be there this year. I have been playing with SwiftUI a little and already am getting very excited for this change. I think this is something that is going to drastically improve the quality of apps and the ease of development. The baked in accessibility is huge, for us at Cerner it is such an important item and having a lot of it out of the box is amazing. Following that, the watchOS changes were my second favorite. Standalone watch apps are amazing and I can’t wait to play with that this week. There are tons of great articles out there for a deep dive into all the announcements and if you want to hear more I would highly recommend checking those out on macrumors.com or 9to5mac.com.</p>\n\n<h1 id=\"state-of-the-union\">State of the Union</h1>\n\n<p>After lunch and the awesome keynote, it was time for the state of the union. This is an address directed at developers over some of the more technical changes and additions Apple has been working on. Once again, there are some great videos and articles that dive into the specifics of the talks.</p>\n\n<h1 id=\"after-hours\">After Hours</h1>\n\n<p>After an awesome day, I was absolutely wiped but decided to go to a couple happy hours/parties before I called it quits. The SetApp/Paddle happy hour was pretty cool but was a pretty European crowd and didn’t talk to too many people. After that I rolled over to The Loop Bash which was dope. Made a couple friends and met up with some devs I follow on Twitter: Ben Sandofsky of Halide Camera and Conrad Kramer of Apple Shortcuts. I didn’t stay long, but was well worth the time. Can’t wait for Day 2!</p>\n",
				"content_text": "\n# Arriving in San Jose\nI got into San Jose late Sunday night and pretty much when straight to bed. The Fairmont has been amazing so far and is close to the conference which is nice.\n\n# Registration and Pre Keynote\nArriving at the convention center was something to behold, being my first major tech conference I was seriously overwhelmed by the whole experience. The outside wall for “Dub Dub” (the official nickname) was incredibly cool and if you watched it, it would light up in spectacular fashion. Getting registered was fun waiting with all the other developers. It is such a global crowd here that making friends in line was always interesting hearing where they were from and what they were working on. The Apple Store employees helping everyone were so high energy and hilarious throughout the day, l literally do not understand how they stayed so excited for the entire day. Once I got registered and received my badge, we left the building and re-entered a line for the keynote. I had gotten there a little bit before 6:30 so I ended up getting a pretty good seat. The wait to enter the Hall for the Keynote took about a total of 3 hours, but they feed us breakfast and was fun meeting more developers.\n\n# Keynote Time\nThe keynote itself was amazing, I think I can say for a lot of us there they revealed a lot more than anyone expected. From SwiftUI to the literally most insane desktop Mac ever, the Mac Pro, it was an amazing keynote. Seeing it in person for the first time was really dope. I have watched it every year since high school and it was amazing getting to actually be there this year. I have been playing with SwiftUI a little and already am getting very excited for this change. I think this is something that is going to drastically improve the quality of apps and the ease of development. The baked in accessibility is huge, for us at Cerner it is such an important item and having a lot of it out of the box is amazing. Following that, the watchOS changes were my second favorite. Standalone watch apps are amazing and I can’t wait to play with that this week. There are tons of great articles out there for a deep dive into all the announcements and if you want to hear more I would highly recommend checking those out on macrumors.com or 9to5mac.com.\n\n# State of the Union\nAfter lunch and the awesome keynote, it was time for the state of the union. This is an address directed at developers over some of the more technical changes and additions Apple has been working on. Once again, there are some great videos and articles that dive into the specifics of the talks.\n\n# After Hours\nAfter an awesome day, I was absolutely wiped but decided to go to a couple happy hours/parties before I called it quits. The SetApp/Paddle happy hour was pretty cool but was a pretty European crowd and didn’t talk to too many people. After that I rolled over to The Loop Bash which was dope. Made a couple friends and met up with some devs I follow on Twitter: Ben Sandofsky of Halide Camera and Conrad Kramer of Apple Shortcuts. I didn’t stay long, but was well worth the time. Can’t wait for Day 2!\n",
				"date_published": "2019-06-03T18:00:00-06:00",
				"url": "https://grantisom.com/2019/06/03/wwdc-day.html",
				"tags": ["wwdc ios conferences"]
			},
			{
				"id": "http://grantisom.micro.blog/2019/05/30/listwithme-creating-an.html",
				"title": "ListWithMe, Creating an iMessage-only Application",
				"content_html": "<p>Over the past month, I built a small iMessage app that allows users to create editable lists in their conversations. The app itself is nothing too flashy, but it was something I hadn’t found a solid solution to and was a great excuse to get some experience with standalone iMessage apps. My wife and I use it whenever we have errands to run after work or a handful of things to get done during the week. Please check it out and let me know what you think!</p>\n\n<p><a href=\"https://www.producthunt.com/posts/listwithme\">Product Hunt</a>\n <a href=\"https://apps.apple.com/ca/app/listwithme/id1224284271\">App Store</a></p>\n\n<p>It was pretty easy getting up and going with the  <a href=\"https://developer.apple.com/documentation/messages\">Messages Framework</a> . The Delegate methods are very straight forward and there are not too many additional situations to handle outside of what you would normally do for a UIViewController. The main and most important thing to take care of is making sure you update the views appropriately when the user expands or minimizes the app view. Feel free to check out my  <a href=\"https://github.com/glisom/ListWithMe\">implementation on Github</a> . Standalone iMessage apps can be really useful, the largest downfall I have found is how difficult it is to manage them and find them. A handful of users were frustrated with that and felt that it was a “sketchy” experience after downloading the app because it had no presence on the home screen. If Apple improved the way iMessage apps existed in Messages I think there could be a serious uptick in developers creating these little utilities.</p>\n",
				"content_text": "\nOver the past month, I built a small iMessage app that allows users to create editable lists in their conversations. The app itself is nothing too flashy, but it was something I hadn’t found a solid solution to and was a great excuse to get some experience with standalone iMessage apps. My wife and I use it whenever we have errands to run after work or a handful of things to get done during the week. Please check it out and let me know what you think!\n\n [Product Hunt](https://www.producthunt.com/posts/listwithme)\n [App Store](https://apps.apple.com/ca/app/listwithme/id1224284271)\n\nIt was pretty easy getting up and going with the  [Messages Framework](https://developer.apple.com/documentation/messages) . The Delegate methods are very straight forward and there are not too many additional situations to handle outside of what you would normally do for a UIViewController. The main and most important thing to take care of is making sure you update the views appropriately when the user expands or minimizes the app view. Feel free to check out my  [implementation on Github](https://github.com/glisom/ListWithMe) . Standalone iMessage apps can be really useful, the largest downfall I have found is how difficult it is to manage them and find them. A handful of users were frustrated with that and felt that it was a “sketchy” experience after downloading the app because it had no presence on the home screen. If Apple improved the way iMessage apps existed in Messages I think there could be a serious uptick in developers creating these little utilities.\n",
				"date_published": "2019-05-29T18:00:00-06:00",
				"url": "https://grantisom.com/2019/05/29/listwithme-creating-an.html",
				"tags": ["ios imessages xcode swift"]
			},
			{
				"id": "http://grantisom.micro.blog/2018/11/27/playlists-for-the.html",
				"title": "Playlists for the Seasons",
				"content_html": "\n\n<p>Over the past 4-ish years I have made a playlist for each season as a way to keep track of my favorite songs. Below are links to all of the playlists so far:</p>\n\n<h1 id=\"2018\">2018</h1>\n\n<p><a href=\"https://open.spotify.com/user/1210690156/playlist/4YyYoEbFoYKjsqNoWkXYOw?si=gs5miVTYR8-nE8h9lJO6Ew\">Winter ‘18</a>\n<a href=\"https://open.spotify.com/user/1210690156/playlist/0XapD6DUnM7fqHLbJoSHGE?si=2DJVaUjnS7GlG0dBww2Qww\">Fall ‘18</a>\n<a href=\"https://open.spotify.com/user/1210690156/playlist/6LJXIilQLzWBpkajUAlRjG?si=30WW_CE1QQKjMTvsyM0Nvg\">Summer ‘18</a>\n<a href=\"https://open.spotify.com/user/1210690156/playlist/1AEDo5xuvW2dLiAgKBwSAC?si=F9dVT40dQFaWeuAvdJ23Fg\">Spring ‘18</a></p>\n\n<h1 id=\"2017\">2017</h1>\n\n<p><a href=\"https://open.spotify.com/user/1210690156/playlist/4BzzYLgID0it0weqz97Qoo?si=yYznl9U6QDS72cSkbEXK4Q\">Winter ‘17</a>\n<a href=\"https://open.spotify.com/user/1210690156/playlist/0eUZSkJWncBeeKXPqENXpK?si=ubyUPU1KTuqXfVwvYxYZTA\">Fall ‘17</a>\n<a href=\"https://open.spotify.com/user/1210690156/playlist/3pFQTJJeP2VzVxU6CirviP?si=QEiGwWMwTCmi-INjzLw1Ig\">Summer ‘17</a>\n<a href=\"https://open.spotify.com/user/1210690156/playlist/1oKO2sXb9XSQlezCu8khCt?si=xjjkIy71TauR_2gGWDxDLQ\">Spring ‘17</a></p>\n\n<h1 id=\"2016\">2016</h1>\n\n<p><a href=\"https://open.spotify.com/user/1210690156/playlist/0LmRLlbFy7cJqGsJTGCphH?si=ITBuRWJbTyWDuHmTnc8lJA\">Winter ‘16</a>\n<a href=\"https://open.spotify.com/user/1210690156/playlist/2ew23taCqjDZ1VGvCFJArS?si=UdknNhkBTr-QyZvpBT74xw\">Fall ‘16</a>\n<a href=\"https://open.spotify.com/user/1210690156/playlist/6VkOfz9KPF2m0QtekyLvPI?si=RLHVnW7BRcqYz_IMi2G5oA\">Summer ‘16</a>\n<a href=\"https://open.spotify.com/user/1210690156/playlist/0rsrU0o0CoFF7TMGDt3wOk?si=4MWeJi8TS02M5Kk_DtWyug\">Spring ‘16</a></p>\n\n<h1 id=\"2015\">2015</h1>\n\n<p><a href=\"https://open.spotify.com/user/1210690156/playlist/5CZ16osqN6TL4w60JYjo7i?si=0-yIrcZRRwODZtlHCK28dA\">Winter ‘15</a>\n<a href=\"https://open.spotify.com/user/1210690156/playlist/1ddqMRhJjTZ8ub4vRaVmR4?si=vX1hqHwnRmqr-BScpCPhZQ\">Fall ‘15</a>\n<a href=\"https://open.spotify.com/user/1210690156/playlist/0cGF4hlIaTvppfw2uae6lA?si=r4-zVYT-RVqkUyF-Ak-NHA\">Summer ‘15</a>\n<a href=\"https://open.spotify.com/user/1210690156/playlist/6LayIzU4FQxkjsUWTSYhxT?si=iB_EohPQQcOPoOKS2gKbrQ\">Spring ‘15</a></p>\n\n<h1 id=\"2014\">2014</h1>\n\n<p><a href=\"https://open.spotify.com/user/1210690156/playlist/4iXFgRztHPTrTf9aUilMnC?si=sjWBvmIPSCa-BneX-xTVEQ\">Winter ‘14</a></p>\n",
				"content_text": "\nOver the past 4-ish years I have made a playlist for each season as a way to keep track of my favorite songs. Below are links to all of the playlists so far:\n\n# 2018\n[Winter ‘18](https://open.spotify.com/user/1210690156/playlist/4YyYoEbFoYKjsqNoWkXYOw?si=gs5miVTYR8-nE8h9lJO6Ew)\n[Fall ‘18](https://open.spotify.com/user/1210690156/playlist/0XapD6DUnM7fqHLbJoSHGE?si=2DJVaUjnS7GlG0dBww2Qww)\n[Summer ‘18](https://open.spotify.com/user/1210690156/playlist/6LJXIilQLzWBpkajUAlRjG?si=30WW_CE1QQKjMTvsyM0Nvg)\n[Spring ‘18](https://open.spotify.com/user/1210690156/playlist/1AEDo5xuvW2dLiAgKBwSAC?si=F9dVT40dQFaWeuAvdJ23Fg)\n# 2017\n[Winter ‘17](https://open.spotify.com/user/1210690156/playlist/4BzzYLgID0it0weqz97Qoo?si=yYznl9U6QDS72cSkbEXK4Q)\n[Fall ‘17](https://open.spotify.com/user/1210690156/playlist/0eUZSkJWncBeeKXPqENXpK?si=ubyUPU1KTuqXfVwvYxYZTA)\n[Summer ‘17](https://open.spotify.com/user/1210690156/playlist/3pFQTJJeP2VzVxU6CirviP?si=QEiGwWMwTCmi-INjzLw1Ig)\n[Spring ‘17](https://open.spotify.com/user/1210690156/playlist/1oKO2sXb9XSQlezCu8khCt?si=xjjkIy71TauR_2gGWDxDLQ)\n# 2016\n[Winter ‘16](https://open.spotify.com/user/1210690156/playlist/0LmRLlbFy7cJqGsJTGCphH?si=ITBuRWJbTyWDuHmTnc8lJA)\n[Fall ‘16](https://open.spotify.com/user/1210690156/playlist/2ew23taCqjDZ1VGvCFJArS?si=UdknNhkBTr-QyZvpBT74xw)\n[Summer ‘16](https://open.spotify.com/user/1210690156/playlist/6VkOfz9KPF2m0QtekyLvPI?si=RLHVnW7BRcqYz_IMi2G5oA)\n[Spring ‘16](https://open.spotify.com/user/1210690156/playlist/0rsrU0o0CoFF7TMGDt3wOk?si=4MWeJi8TS02M5Kk_DtWyug)\n# 2015\n[Winter ‘15](https://open.spotify.com/user/1210690156/playlist/5CZ16osqN6TL4w60JYjo7i?si=0-yIrcZRRwODZtlHCK28dA)\n[Fall ‘15](https://open.spotify.com/user/1210690156/playlist/1ddqMRhJjTZ8ub4vRaVmR4?si=vX1hqHwnRmqr-BScpCPhZQ)\n[Summer ‘15](https://open.spotify.com/user/1210690156/playlist/0cGF4hlIaTvppfw2uae6lA?si=r4-zVYT-RVqkUyF-Ak-NHA)\n[Spring ‘15](https://open.spotify.com/user/1210690156/playlist/6LayIzU4FQxkjsUWTSYhxT?si=iB_EohPQQcOPoOKS2gKbrQ)\n# 2014\n[Winter ‘14](https://open.spotify.com/user/1210690156/playlist/4iXFgRztHPTrTf9aUilMnC?si=sjWBvmIPSCa-BneX-xTVEQ)\n",
				"date_published": "2018-11-26T18:00:00-06:00",
				"url": "https://grantisom.com/2018/11/26/playlists-for-the.html",
				"tags": ["music"]
			},
			{
				"id": "http://grantisom.micro.blog/2018/04/02/reading-list-for.html",
				"title": "Reading List for 2018",
				"content_html": "<p>Starting with last year, I have been trying to keep track of the books I read throughout the year. Here is my list so far for this year!</p>\n\n<ul>\n<li>Perelandria by C.S. Lewis</li>\n<li>The Consolation of Philosophy by Boethius</li>\n<li>The Inferno by Dante Alighieri</li>\n<li>Confessions by St. Augustine</li>\n<li>Selected Writings by St. Thomas Aquinas</li>\n<li>Winning Ugly by Brad Gilbert</li>\n<li>Armada by Ernest Cline</li>\n<li>Off to Be the Wizard by Scott Meyer</li>\n<li>Ender’s Game by Orson Scott Card</li>\n<li>Manual for Men by Thomas J. Olmstead, Bishop of Phoenix</li>\n<li>An Unwelcome Quest by Scott Meyer</li>\n<li>Spell or High Water by Scott Meyer</li>\n<li>Foundation by Issac Asimov</li>\n<li>Foundation and Empire by Issac Asimov</li>\n</ul>\n",
				"content_text": "\nStarting with last year, I have been trying to keep track of the books I read throughout the year. Here is my list so far for this year!\n\n* Perelandria by C.S. Lewis\n* The Consolation of Philosophy by Boethius\n* The Inferno by Dante Alighieri\n* Confessions by St. Augustine\n* Selected Writings by St. Thomas Aquinas\n* Winning Ugly by Brad Gilbert\n* Armada by Ernest Cline\n* Off to Be the Wizard by Scott Meyer\n* Ender’s Game by Orson Scott Card\n* Manual for Men by Thomas J. Olmstead, Bishop of Phoenix\n* An Unwelcome Quest by Scott Meyer\n* Spell or High Water by Scott Meyer\n* Foundation by Issac Asimov\n* Foundation and Empire by Issac Asimov\n",
				"date_published": "2018-04-01T18:00:00-06:00",
				"url": "https://grantisom.com/2018/04/01/reading-list-for.html",
				"tags": ["reading books"]
			}
	]
}
